# 1. Create databases (sales_db and trip_db) in HMS

In [12]:
%%sql

-- Check metastore status
--show schemas from hms;
--show tables from hms.nyc100;
--drop table hms.nyc_taxis_db.test;
--drop schema hms.nyc;

CREATE DATABASE sales_db LOCATION 's3a://lakehouse/warehouse/sales_db';
CREATE DATABASE trip_db LOCATION 's3a://lakehouse/warehouse/trip_db';

++
||
++
++

# 2. Dataframe-based Spark example with Python API

In [13]:
SALES_TABLE="hms.sales_db.sales_summary"

In [3]:
# loading parquet file from local storage
sales_df = spark.read.parquet("/home/iceberg/datasets/sales")
sales_df.show(5)

+-------------------+----------------------+--------------------+----------------+---------------------+----------------+-------------+----------------+-----------+--------+-------------------+
|ProductCategoryName|ProductSubcategoryName|         ProductName|    CustomerName|SalesTerritoryCountry|SalesOrderNumber|OrderQuantity|TotalProductCost|SalesAmount|  TaxAmt|          OrderDate|
+-------------------+----------------------+--------------------+----------------+---------------------+----------------+-------------+----------------+-----------+--------+-------------------+
|              Bikes|            Road Bikes|    Road-150 Red, 62|     Cole Watson|               Canada|         SO43697|            1|       2171.2942|    3578.27|286.2616|2010-12-29 00:00:00|
|              Bikes|        Mountain Bikes|Mountain-100 Silv...|Rachael Martinez|               France|         SO43698|            1|       1912.1544|    3399.99|271.9992|2010-12-29 00:00:00|
|              Bikes|        Mountain Bikes|Mountain-100 Silv...|   Sydney Wright|        United States|         SO43699|            1|       1912.1544|    3399.99|271.9992|2010-12-29 00:00:00|
|              Bikes|            Road Bikes|  Road-650 Black, 62|    Ruben Prasad|        United States|         SO43700|            1|        413.1463|   699.0982| 55.9279|2010-12-29 00:00:00|
|              Bikes|        Mountain Bikes|Mountain-100 Silv...|     Christy Zhu|            Australia|         SO43701|            1|       1912.1544|    3399.99|271.9992|2010-12-29 00:00:00|
+-------------------+----------------------+--------------------+----------------+---------------------+----------------+-------------+----------------+-----------+--------+-------------------+
only showing top 5 rows

In [ ]:
# Create Iceberg table
sales_df.writeTo(SALES_TABLE).create()

In [7]:
# Read Iceberg table
spark.read.table(SALES_TABLE).show(5)

+-------------------+----------------------+--------------------+----------------+---------------------+----------------+-------------+----------------+-----------+--------+-------------------+
|ProductCategoryName|ProductSubcategoryName|         ProductName|    CustomerName|SalesTerritoryCountry|SalesOrderNumber|OrderQuantity|TotalProductCost|SalesAmount|  TaxAmt|          OrderDate|
+-------------------+----------------------+--------------------+----------------+---------------------+----------------+-------------+----------------+-----------+--------+-------------------+
|              Bikes|            Road Bikes|    Road-150 Red, 62|     Cole Watson|               Canada|         SO43697|            1|       2171.2942|    3578.27|286.2616|2010-12-29 00:00:00|
|              Bikes|        Mountain Bikes|Mountain-100 Silv...|Rachael Martinez|               France|         SO43698|            1|       1912.1544|    3399.99|271.9992|2010-12-29 00:00:00|
|              Bikes|        Mountain Bikes|Mountain-100 Silv...|   Sydney Wright|        United States|         SO43699|            1|       1912.1544|    3399.99|271.9992|2010-12-29 00:00:00|
|              Bikes|            Road Bikes|  Road-650 Black, 62|    Ruben Prasad|        United States|         SO43700|            1|        413.1463|   699.0982| 55.9279|2010-12-29 00:00:00|
|              Bikes|        Mountain Bikes|Mountain-100 Silv...|     Christy Zhu|            Australia|         SO43701|            1|       1912.1544|    3399.99|271.9992|2010-12-29 00:00:00|
+-------------------+----------------------+--------------------+----------------+---------------------+----------------+-------------+----------------+-----------+--------+-------------------+
only showing top 5 rows

# 3. Spark-SQL example

In [16]:
TAXIS_TABLE="hms.trip_db.trips"

In [17]:
%%sql
CREATE TABLE hms.trip_db.trips
(
  vendor_id bigint,
  trip_id bigint,
  trip_distance float,
  fare_amount double,
  store_and_fwd_flag string
)
PARTITIONED BY (vendor_id);

++
||
++
++

In [18]:
%%sql
INSERT INTO hms.trip_db.trips
VALUES (1, 1000371, 1.8, 15.32, 'N'), (2, 1000372, 2.5, 22.15, 'N'), (2, 1000373, 0.9, 9.01, 'N'), (1, 1000374, 8.4, 42.13, 'Y');

++
||
++
++

In [19]:
%%sql
SELECT * FROM  hms.trip_db.trips;

+-----------+---------+--------------------+-------------+--------------------+
| vendor_id | trip_id |      trip_distance | fare_amount | store_and_fwd_flag |
+-----------+---------+--------------------+-------------+--------------------+
|         1 | 1000371 | 1.7999999523162842 |       15.32 |                  N |
|         1 | 1000374 |  8.399999618530273 |       42.13 |                  Y |
|         2 | 1000372 |                2.5 |       22.15 |                  N |
|         2 | 1000373 | 0.8999999761581421 |        9.01 |                  N |
+-----------+---------+--------------------+-------------+--------------------+